import { Event } from "./models/Events";
import arzi from '../../data/covers/arzi.jpeg'
import eden from '../../data/covers/edan.jpg'
import koko from "../../data/covers/koko.jpeg"
import poriat from '../../data/covers/poriat.jpeg'
import noa from '../../data/covers/noa.jpeg'


import {mainSeats ,
   theatherSurroundSeatsMobileTextPositons ,
    theatherSurroundSeatsTextPositions ,
    surroundSeats
  } from '../constants/theathers/eilat_1'





export const theather2 = {
  1 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ],
  2 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0  ],   
  3 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0],
  4 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0],
  5 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0],
  6 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0,0,0],
  7 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0,0,0],
  8 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0,0,0],
  9 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0,0,0],
  10 : [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ,0 ,0 ,0 ,0 ,0 ,0,0,0,0,0,0],
  11: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,],
  12: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,],
  13: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,],
  14: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,],
  15: [0, 0, 0, 0, 0, 0, 0, 0, 0, ],
  16: [0, 0, 0, 0, 0, 0, 0, ],
  17: [0, 0, 0, 0, 0, 0, 0, 0, ]

}


export const events: Event[] = [
  {
    id: 1,
    name: '  הופעה של .....  ',
    adText :" מופע של פעם בחיים באו להתרגש איתנו  ",
    ticketCost: 200,
    citizenTicketCost :1,
    cover:arzi,
    seats:mainSeats,
    textposions:theatherSurroundSeatsMobileTextPositons

  },
  {
   id: 2,
   name: 'עידן רייכל ',
   adText :" מופע של פעם בחיים באו להתרגש איתנו  ",
   cover:eden,
   ticketCost: 200,
   seats: theather2,
   citizenTicketCost:1
  
  //  
  //    id: 3,
     
  //    name: ' נועה קיריל  ',
  //    adText :" מופע של פעם בחיים באו להתרגש איתנו  ",
  //    ticketCost: 200,
  //    cover:noa,

  //     seats: { theather1 }
    
  //  },
  //  {
  //    id: 4,
  //    name: '  שלומי קוריאט מלך הבידור   ',
  //    adText :" מופע של פעם בחיים באו להתרגש איתנו  ",
  //    ticketCost: 200,
  //    cover:poriat,
  //    seats: {
  //      A: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      B: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      C: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      D: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      E: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      F: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      G: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
  //    }
  //  },
  //  {
  //    id: 5,
  //    name: 'קוקו מאילת ',
  //    adText :" מופע של פעם בחיים באו להתרגש איתנו  ",
  //    ticketCost: 200,
  //    cover:koko,
  //    seats: {
  //      A: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      B: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      C: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      D: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      E: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      F: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  //      G: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
  //    }
    }
]